Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: For a value x of a floating-point type F, the magnitude can be calculated as the following, where ** is exponentiation:
ja: 浮動小数点型Fの値xに対して、規模は次のように計算されることができます、ここで**は冪演算です：

source: For an enum, all its associated values must conform to Equatable.
ja: enumに対して、すべてのそれの関連値はEquatableに準拠しなければなりません。

source: For an enum, all its associated values must conform to Hashable.
ja: enumに対して、すべてのそれの関連値はHashableに準拠しなければなりません。

source: For an enumeration, all its associated values must conform to Equatable and Hashable.
ja: 列挙に対して、全てのそれの関連値は、EquatableおよびHashableに準拠しなければなりません。

source: For an index i into a collection c, calling c.index(after: i) returns the same index every time.
ja: コレクションcへのインデックスiに対して、c.index(after: i)を呼び出すことはいつでも同じインデックスを返します。

source: For an instance of Array, startIndex is always zero.
ja: Arrayのインスタンスに対して、startIndexは常にゼロです。

source: For an instance of ContiguousArray, startIndex is always zero.
ja: ContiguousArrayのインスタンスに対して、startIndexは常にゼロです。

source: For an unspecialized Objective-C type, Swift infers the generic parameterization for the imported class type constraints.
ja: 特殊化されないObjective-C型に対して、スウィフトは総称体パラメータ化をインポートされたクラス型制約に対して推測します。

source: For any NaN value, the property’s value is “nan”, and for positive and negative infinity its value is “inf” and “-inf”.
ja: あらゆるNaN値に対して、このプロパティの持つ値は “nan” です、そして正と負の無限大に対してそれの値は “inf” と “-inf” です。

source: For any finite value x, x.nextDown is less than x.
ja: 何らかの有限の値xに対して、x.nextDownはxより小さいです。

source: For any finite value x, x.nextUp is greater than x.
ja: 何らかの有限値xに対して、x.nextUpはxより大きいです。

source: For any finite value, this property provides a string that can be converted back to an instance of Double without rounding errors.
ja: あらゆる有限の値に対して、このプロパティはある文字列を提供します、それは丸め誤差なしに逆にDoubleのインスタンスへと変換されることが可能です。

source: For any finite value, this property provides a string that can be converted back to an instance of Float16 without rounding errors.
ja: あらゆる有限の値に対して、このプロパティはある文字列を提供します、それは丸め誤差なしに逆にFloat16のインスタンスへと変換されることが可能です。

source: For any finite value, this property provides a string that can be converted back to an instance of Float80 without rounding errors.
ja: あらゆる有限の値に対して、このプロパティはある文字列を提供します、それは丸め誤差なしに逆にFloat80のインスタンスへと変換されることが可能です。

source: For any finite value, this property provides a string that can be converted back to an instance of Float without rounding errors.
ja: あらゆる有限の値に対して、このプロパティはある文字列を提供します、それは丸め誤差なしに逆にFloatのインスタンスへと変換されることが可能です。

source: For any floating-point value x of type F, the result of the following is equal to x, with the distinction that the result is canonicalized if x is in a noncanonical encoding:
ja: 何らかの浮動小数点値型Fのxに対して、以下の結果はxと等しいです、その違いはxが非正準符号化になるならば結果は正準化されることです。

source: For any numeric value x, x.magnitude is the absolute value of x.
ja: 何らかの数値xに対して、x.magnitudeはxの絶対値です。

source: For any representable power of two, significandWidth is zero, because significand is 1.0.
ja: あらゆる表現可能な２の冪に対して、significandWidthはゼロです、なぜならsignificandが1.0だからです。

source: For any two integers a and b, their quotient q, and their remainder r, a == b * q + r.
ja: 何らかの２つの整数aとb、それらの商q、そしてそれらの余りrに対して、a == b * q + r。

source: For any value, x + .zero == x and .zero + x == x.
ja: あらゆる値に対して、x + .zero == xかつ.zero + x == x。

source: For any values a and b, a != b implies that a == b is false.
ja: 何らかのaとbに対して、a != bはa == bがfalseであることを意味します。

source: For any values a and b, a == b implies that a != b is false.
ja: 何らかの値aとbに対して、a == bはa != bがfalseであることを意味します。

source: For arrays of most Element types, this storage is a contiguous block of memory.
ja: ほとんどのElement型の配列に対して、このストレージは隣接メモリブロックです。

source: For arrays with an Element type that is a class or @objc protocol type, this storage can be a contiguous block of memory or an instance of NSArray.
ja: クラスや@objcプロトコル型であるElement型を持つ配列に対して、このストレージは隣接メモリブロックまたはNSArrayのインスタンスであることができます。

source: For bridging to be possible, the Element type of your array must be a class, an @objc protocol (a protocol imported from Objective-C or marked with the @objc attribute), or a type that bridges to a Foundation type.
ja: ブリッジが可能にされるには、あなたの配列のElement型は、あるクラス、@objcプロトコル（Objective-Cからインポートされるまたは@objc属性で印されるプロトコル）、またはあるFoundation型にブリッジされる型でなければなりません。

source: For bridging to be possible, the Key and Value types of a dictionary must be classes, @objc protocols, or types that bridge to Foundation types.
ja: ブリッジが可能にされるには、辞書のKeyとValue型がクラス、@objcプロトコル、またはFoundation型にブリッジする型でなければなりません。

source: For class types, the following mappings apply:
ja: クラス型のために、以下のマッピングが適用されます：

source: For collections that don’t conform to RandomAccessCollection, accessing the count property iterates through the elements of the collection.
ja: RandomAccessCollectionに準拠しないコレクションに対して、countプロパティにアクセスすることはコレクションの要素を始めから終わりまで反復します。

source: For example, AnyHashable(42) compares as equal to AnyHashable(42 as NSNumber).
ja: 例えば、AnyHashable(42)は、AnyHashable(42 as NSNumber)と等しいとみなされます。

source: For example, 6 is a multiple of 3 because 6 = 2*3.
ja: 例えば、6は3の倍数です、なぜなら6 = 2*3なので。

source: For example, a country’s Unicode flag character is made up of two regional indicator scalar values that correspond to that country’s ISO 3166-1 alpha-2 code.
ja: 例えば、ある国のユニコードの国旗文字は、その国のISO 3166-1 alpha-2コードに対応する２つの地域指定スカラー値から作り上げられます。

source: For example, a function pointer that has the type int (*)(void) in C is imported into Swift as @convention(c) () -> Int32.
ja: 例えば、Cにおけるint (*)(void)型をもつ関数ポインターは、スウィフトに@convention(c) () -> Int32としてインポートされます。

source: For example, a program can import a C API like the one defined here:
ja: 例えば、あるプログラムはC APIをここで定義されるもののようにインポートできます：

source: For example, a random-access collection, which can measure the distance between two indices in O(1) time, can calculate its count property in O(1) time.
ja: 例えば、ランダムアクセスのコレクションは、２つのインデックス間の隔たりをO(1)時間で測ることが可能で、それのcountプロパティをO(1)時間で計算できます。

source: For example, a type might cache an expensive computed value so that it only needs to calculate it once.
ja: 例えば、ある型は高くつく計算値をキャッシュするかもしれません、それを計算する必要がただ一度だけであるように。

source: For example, an app might recommend multiple different penpals in response to user feedback.
ja: 例えば、あるアプリはユーザのフィードバックに答えて複数の異なる文通友達を勧めるかもしれません。

source: For example, an instance of Int16 can represent the value 500, so the first conversion in the code sample below succeeds.
ja: 例えば、Int16のインスタンスは値500を表せます、それで下のコード例の最初の変換は成功します。

source: For example, bridging from NSArray to Array<Int> performs such a copy.
ja: 例えば、NSArrayからArray<Int>へのブリッジは、そのようなコピーを実行します。

source: For example, consider a C structure named Cake that contains the fields layers and height nested within an unnamed union type, and a field toppings of an unnamed struct type:
ja: 例えば、Cakeと名前を付けられるC構造体を考えてください、それはフィールドlayersおよびheightを無名のunion型内部に入れ子にされて、そしてフィールドtoppingsを無名struct型で含みます：

source: For example, consider a C union named SchroedingersCat that has an isAlive and an isDead field:
ja: 例えば、SchroedingersCatと名前を付けられるC共用体を考えてください、それはisAliveとisDeadフィールドを持ちます：

source: For example, consider the present(completion:) method from PassKit.
ja: 例として、PassKit由来のpresent(completion:)メソッドを考えてみてください。

source: For example, consider the removeItem(at:) method from FileManager.
ja: 例えば、removeItem(at:)メソッドでFileManagerからのものを考えてください。

source: For example, consider the write(_:timeout:completionHandler:) method from URLSessionStreamTask.
ja: 例えば、URLSessionStreamTask由来のwrite(_:timeout:completionHandler:)メソッドを考えてみてください。

source: For example, consider the following C function declarations:
ja: 例えば、以下のC関数宣言を考えてみてください：

source: For example, consider the following Objective-C class and category declarations:
ja: 例えば、次のObjective-Cクラスおよびカテゴリ宣言を考えてください：

source: For example, even if the operation is running code that never checks for cancellation, a cancellation handler still runs and provides a chance to run some cleanup code.
ja: 例えば、たとえ取り消しを決して調べないコードを演算が実行しているとしても、ある取り消しハンドラが依然として動作してそしてあるクリーンアップコードを実行する機会を提供します。

source: For example, given the following C structure:
ja: 例えば、以下のC構造体を与えられて：

source: For example, given the following Objective-C method that performs an operation on the specified class:
ja: 例えば、指定されたクラス上である演算を実行する以下のObjective-Cメソッドを与えられて：

source: For example, given the following Objective-C property declarations:
ja: 例えば、以下のObjective-Cプロパティを与えられて：

source: For example, here’s an unannotated C function:
ja: 例えば、ここに注釈をつけられなかったC関数があります：

source: For example, here’s how to call the vasprintf(_:_:_:) function in Swift:
ja: 例えば、ここにvasprintf(_:_:_:)関数をSwiftにおいて呼び出す方法があります：

source: For example, if the two year properties are equal but the two month properties are not, the date with the lesser value for month is the lesser of the two dates.
ja: 例えば、２つのyearプロパティは等しいけれども２つのmonthプロパティは異なるならば、monthに対してより少ない値を持つ日付は２つの日付のうちより少ないものです。

source: For example, if you have a type that represents a local database connection, the code that manages access to that database needs full control over the state of the database as viewed from your app.
ja: 例えば、あなたがローカルデータベース接続を表す型を持つならば、そのデータベースへのアクセスを管理するコードは、データベースの状態すべてわたって完全な制御をあなたのアプリから眺められる際に必要とします。

source: For example, if you update the last element of the absences array from 0 to 2, the secondHalf slice is unchanged.
ja: 例えば、あなたがabsences配列の最後の要素を0から2に更新する場合、secondHalfスライスは変化していません。

source: For example, if you want to print only the first word in a string, you can search for the index of the first space, and then create a substring up to that position.
ja: 例えば、あなたがある文字列の最初の単語のみを出力したいならば、最初の空白のインデックスを捜して、それからその位置までの下位文字列を作成してください。

source: For example, if your array’s elements conform to Comparable, you can call the sort() method without using arguments to sort the elements of your array in ascending order.
ja: 例えば、あなたの配列のもつ要素がComparableに準拠するならば、あなたはsort()メソッドを引数を使うことなく呼び出して、あなたの配列の要素を昇順にソートすることができます。

source: For example, in a fixed-width integer type with a bitWidth value of 8, the number -8 has three trailing zeros.
ja: 例えば、8のbitWidth値を持つ固定長整数型において、数-8は後に続くゼロを３つ持ちます。

source: For example, in a fixed-width integer type with a bitWidth value of 8, the number 31 has five bits equal to 1.
ja: 例えば、８のbitWidth値を持つ固定長整数型において、数31は1に等しいビットを５つ持ちます。

source: For example, in a fixed-width integer type with a bitWidth value of 8, the number 31 has three leading zeros.
ja: 例えば、８のbitWidth値を持つ固定長整数型において、数31は３つの先頭のゼロを持ちます。

source: For example, in an integer type with a bitWidth value of 8, the number 31 has three leading zeros.
ja: 例えば、８のbitWidth値を持つ整数型において、数31は３つの先頭のゼロを持ちます。

source: For example, in the code below, nothing is canceled and the group doesn’t throw an error:
ja: 例えば、下のコードにおいて、何も取り消されません、そしてグループはエラーをスローしません：

source: For example, it would be reasonable to implement alternative operations in which operating on a signaling NaN triggers a runtime error or results in a diagnostic for debugging purposes.
ja: 例えば、それらにおいてはシグナルNaNに関する演算が実行時エラーを引き起こすまたはデバッグ目的の診断という結果になるといった、代替の演算を実装するのが妥当であるかもしれません。

source: For example, many Objective-C frameworks expose classes that you are expected to subclass.
ja: 例えば、多くのObjective-Cフレームワークは、あなたがサブクラスを作るべき様々なクラスを公開します。

source: For example, passing an empty range as other triggers a runtime error, because an empty range cannot be represented by a closed range instance.
ja: 例えば、空の範囲をotherとして渡すことは実行時エラーの引き金となります、空の範囲は完結範囲インスタンスによって表現されることができないからです。

source: For example, suppose the C function above doesn't retain the CFString object before returning it.
ja: 例えば、上のC関数がCFStringオブジェクトを、それを返す前にリテインしないと思ってください。

source: For example, suppose you have an array holding the number of absences from each class during a session.
ja: 例えば、あなたがある学期（２学期制）の各クラスの欠席者数が入った配列を持つと考えてください。

source: For example, the sign(_:using:completion:) method from PassKit is declared like this in Objective-C:
ja: 例えば、PassKit由来のsign(_:using:completion:)メソッドはObjective-Cにおいてこのように宣言されます：

source: For example, the CompassDirection enumeration declared in this example conforms to CaseIterable.
ja: 例えば、この例で定義されるCompassDirection列挙はCaseIterableに準拠します。

source: For example, the Float type has an exponentBitCount of 8, which gives an exponent bias of 127 by the calculation above.
ja: 例えば、Float型は、８のexponentBitCountを持ちます、それは127の指数バイアスを上記の計算によって与えます。

source: For example, the NSJSONReadingOptions option set is imported as JSONSerialization.ReadingOptions.
ja: 例えば、NSJSONReadingOptionsオプションセットはJSONSerialization.ReadingOptionsとしてインポートされます。

source: For example, the keys property of a dictionary isn’t an array with its own storage, it’s a collection that maps its elements from the dictionary only when they’re accessed, saving the time and space needed to allocate an array.
ja: 例えば、辞書のkeysプロパティはそれ自身のストレージを持つことになる配列ではありません、それはコレクションです、それはそれの要素らをそれらがアクセスされた時に限り辞書からマップします、そして配列を割り当てるのに必要とされる時間と空間を節約しています。

source: For example, the sum(_:) function shown here takes an Int array as a parameter:
ja: 例えば、ここで示すsum(_:)関数は、Intリテラルをパラメータとしてとります：

source: For example, the log(name:value:) function shown here has an unconstrained generic value parameter.
ja: 例えば、ここで示すlog(name:value:)関数は、制約のない総称体のvalueパラメータを持ちます。

source: For example, the .map(_:) method returns a AsyncMapSequence (or a AsyncThrowingMapSequence, if the closure you provide to the map(_:) method can throw an error).
ja: 例えば、.map(_:)メソッドはあるAsyncMapSequenceを返します（またはAsyncThrowingMapSequenceを、あなたがmap(_:)メソッドに提供するクロージャがエラーをスローするならば）。

source: For example, the digits() function in the following example creates an iterator over a collection that lazily maps the elements of a Range<Int> instance to strings.
ja: 例えば、以下の例のdigits()関数は、あるコレクションを覆うイテレータを作成します、それはRange<Int>インスタンスの要素を文字列へと遅延にマップします。

source: For example, the contains(_:) method returns a Boolean value that indicates if a given value exists in the AsyncSequence.
ja: 例えば、contains(_:)メソッドはあるブール値を返します、それはある与えられた値がAsyncSequenceの中に存在するかどうかを指し示します。

source: For example, the Int8 type has a bitWidth value of 8 and can store any integer in the range -128...127.
ja: 例えば、Int8型は、８のbitWidth値を持ち、範囲-128...127の中の何らかの整数を格納できます。

source: For example, the code sample below creates a dictionary with string keys and values.
ja: 例えば、下のコード見本はある辞書を文字列のキーと値で作成します。

source: For example, the contents of a String are logged, as are the components of an NSColor or UIColor.
ja: 例えば、あるStringのそれら内容が記録されます、あるNSColorまたはUIColorの構成要素それらのように。

source: For example, the following characters all represent currency symbols:
ja: 例えば、以下の表意文字は全て通貨記号を表します：

source: For example, the following characters all represent math symbols:
ja: 例えば、以下の表意文字は全て数学シンボルを表します：

source: For example, the following characters all represent newlines:
ja: 例えば、以下の表意文字は全てニューラインを表します：

source: For example, the following characters all represent numbers:
ja: 例えば、以下の表意文字は全て数字を表します：

source: For example, the following characters all represent punctuation:
ja: 例えば、以下の表意文字は全て句読点を表します：

source: For example, the following characters all represent symbols:
ja: 例えば、以下の表意文字は全て記号を表します：

source: For example, the following characters all represent whitespace:
ja: 例えば、以下の表意文字は全て空白を表します：

source: For example, the following characters all represent whole numbers:
ja: 例えば、以下の表意文字は全て整数を表します：

source: For example, the following characters are all letters:
ja: 以下の文字は全て表音文字です：

source: For example, the following code provides a binaryString property on every fixed-width integer that represents the number’s binary representation, split into 8-bit chunks.
ja: 例えば、以下のコードはbinaryStringプロパティをあらゆる固定長整数に関して提供します、それは数のバイナリ表現を、８ビットの塊へと分割して表します。

source: For example, the following code sample does not compile, because it attempts to use the integer i in a logical context:
ja: 例えば、以下のコードサンプルはコンパイルしません、なぜならそれが整数iを論理的文脈において使おうとするからです：

source: For example, the following conversions result in nil:
ja: 例えば、次の変換はnilという結果になります：

source: For example, the number -8 has three trailing zeros.
ja: 例えば、数-8は後に続くゼロを３つ持ちます。

source: For example, the parameter passed as value to the printSmileyInfo(_:) function in the example below is an instance of the Smiley class or one of its subclasses.
ja: 例えば、下の例においてvalueとしてprintSmileyInfo(_:)関数に渡されるパラメータは、Smileyクラスまたはそれのサブクラスの１つのインスタンスです。

source: For example, the special “not a number” value for floating-point types (FloatingPoint.nan) compares as neither less than, greater than, nor equal to any normal floating-point value.
ja: 例えば、浮動小数点型のための特別な「数でない」値（FloatingPoint.nan）は、何らかの通常の浮動小数点値とより少ないでも、より大きいでも、等しいでもないような比較をします。

source: For example, this custom Point struct uses the default representation supplied by the standard library:
ja: 例えば、このあつらえのPoint structは、標準ライブラリによって提供される省略時の表現を使います：

source: For example, this version of the update(withValue) method will re-copy myStorage on every call:
ja: 例えば、このバージョンのupdate(withValue)メソッドはmyStorageを全ての呼び出しで再コピーします：

source: For example, to check whether an array contains a particular value, you can pass the value itself to the contains(_:) method when the array’s element conforms to Equatable instead of providing a closure that determines equivalence.
ja: 例えば、ある配列がある特定の値を含むかどうか調べるには、あなたはその値自体をcontains(_:)メソッドに渡すことが、その配列の要素がEquatableに準拠する場合には、同等を判定するクロージャを提供する代わりに可能です。

source: For example, to find the key for a particular value in a dictionary, use the firstIndex(where:) method.
ja: 例えば、辞書において特定の値に対するキーを見つけるには、firstIndex(where:)メソッドを使ってください。

source: For example, to get the reversed version of a string, reverse its characters and initialize a new String instance from the result.
ja: 例えば、ある文字列の逆版を得るには、それの文字を逆にして、新しいStringインスタンスをその結果から初期化してください。

source: For example, using a PartialRangeFrom range expression with an array accesses the subrange from the start of the range expression until the end of the array.
ja: 例えば、PartialRangeFrom範囲式をある配列で使うことは、その下位範囲に範囲式の始まりから配列の終わりまでにアクセスします。

source: For example, when converting a 16-bit value to an 8-bit type, only the lower 8 bits of source are used.
ja: 例えば、16bit値を8bit型へ変換する場合、sourceの最も下位の8ビットが使われます。

source: For example, when the transform receives 3 from the base sequence, it creates a new Counter that produces the values 1, 2, and 3.
ja: 例えば、変換が3を基底シーケンスから受け取る場合、それは新しいCounterを作成します、そしてそれが値1、2、そして3を生み出します。

source: For example, you can add a single element to an array by using a CollectionOfOne instance with the concatenation operator (+):
ja: 例えば、あなたは単一の要素を配列へと追加することが、CollectionOfOneインスタンスを連結演算子（+）とともに使うことによって可能です：

source: For example, you can also access the first character of text using the first property, which has the value of the first element of the collection, or nil if the collection is empty.
ja: 例えば、あなたはまたtextの最初の文字にアクセスすることがfirstプロパティを使って行えます、それはコレクションの最初の要素の値、またはコレクションが空ならばnilを持ちます。

source: For example, you can concatenate the elements of a Range<Int> instance and an integer array.
ja: 例えば、あなたはあるRange<Int>インスタンスとある整数配列とに属する要素を連結することができます。

source: For example, you can concatenate the elements of an integer array and a Range<Int> instance.
ja: 例えば、あなたはある整数配列とあるRange<Int>インスタンスとに属する要素を連結することができます。

source: For example, you can concatenate the elements of two integer arrays.
ja: 例えば、あなたは２つの整数配列に属する要素を連結することができます。

source: For example, you can replace an element of an array by using its subscript.
ja: 例えば、あなたは配列の中のある要素をそれの添え字を使うことによって置き換えることができます。

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled() method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled()メソッドをその範囲上で呼び出すことによって可能です：

source: For example, you can shuffle the numbers between 0 and 9 by calling the shuffled(using:) method on that range:
ja: 例えば、あなたは0と9の間の数をシャッフルすることが、shuffled(using:)メソッドをその範囲上で呼び出すことによって可能です：

source: For example, you can test whether the first UInt8 value in a string’s UTF-8 encoding is equal to the first UInt32 value in its Unicode scalar view:
ja: 例えば、あなたはある文字列のUTF-8符号化の中の最初のUInt8値が、それのユニコードスカラー値での最初のUInt32と等しいかどうかを試験できます。

source: For example, you can test whether the first UInt8 value in a string’s UTF-8 encoding is not equal to the first UInt32 value in its Unicode scalar view:
ja: 例えば、あなたはある文字列のUTF-8符号化の中の最初のUInt8値が、それのユニコードスカラー値での最初のUInt32と等しくないかどうかを試験できます。

source: For example, you can use the shuffle(using:) method to randomly reorder the elements of an array.
ja: 例えば、あなたはshuffle(using:)メソッドを使って、配列の要素を無作為に再配列することができます。

source: For example, you can use this method on a sequence of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値からなるシーケンス上で使うことで、それらの和または積を見つけます。

source: For example, you can use this method on an array of integers to filter adjacent equal entries or count frequencies.
ja: 例えば、あなたはこのメソッドを整数からなる配列で使うことで、隣接する同等の項目をフィルタしたり頻度を数えたりできます。

source: For example, you can use this method on an array of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値いくつかからなる配列で使うことで、それらの和または積を見つけます。

source: For example, you can use this method on an sequence of numbers to find their sum or product.
ja: 例えば、あなたはこのメソッドを数値からなるシーケンス上で使うことで、それらの和または積を見つけます。

source: For example, you could define a User type with an id property that is stable across your app and your app’s database storage.
ja: 例えば、あなたはあるUser型を、あなたのアプリとあなたのアプリのもつデータベースストレージにわたって安定しているあるidプロパティで定義できます。

source: For example, you might want to create an array with the integers from 1 through 7.
ja: 例えば、あなたは配列を１から７までの整数で作成したいかもしれません。

source: For example, “ϰ” (U+03F0 GREEK KAPPA SYMBOL) is considered both a mathematical symbol and a letter.
ja: 例えば、 “ϰ” (U+03F0 GREEK KAPPA SYMBOL) は、数学シンボルと表音文字の両方にみなされます。

source: For example:
ja: 例えば：

source: For extensible floating-point types, significandBitCount should be the maximum allowed significand width (without counting any leading integral bit of the significand).
ja: 拡張可能な浮動小数点型に対して、significandBitCountは許される最大仮数幅であるべきです（全く仮数の先頭整数ビットを数えることなく）。

source: For fixed-width floating-point types, this is the actual number of fractional significand bits.
ja: 固定長浮動小数点型に対して、これは小数部仮数ビットの実際の数です。

source: For information about asynchronous functions, see Concurrency in The Swift Programming Language.
ja: 非同期関数についての情報として、並行性をThe Swift Programming Languageで見てください。

source: For instances of NSDictionary that are already immutable, copy(with:) usually returns the same dictionary in O(1) time; otherwise, the copying performance is unspecified.
ja: すでに可変のNSDictionaryのインスタンスに対しては、copy(with:)は通常同じ辞書をO(1)時間で返します；そうでなければ、このコピー性能は不定です。

source: For instances of NSArray that are already immutable, copy(with:) usually returns the same array in O(1) time; otherwise, the copying performance is unspecified.
ja: 元から不変であるNSArrayのインスタンスに対しては、copy(with:)は大抵は同じ配列をO(1)時間で返します；そうでなければ、コピーする性能は不定です。

source: For integer types, any remainder of the division is discarded.
ja: 整数型に対して、除算の余りは何であれ破棄されます。

source: For more about arithmetic with overflow operators, see Overflow Operators in The Swift Programming Language.
ja: オーバーフロー演算子を使う算術についてさらには、オーバーフロー演算子をSwiftプログラミング言語で見てください。

source: For more information about index invalidation in mutable collections, see the reference for the MutableCollection and RangeReplaceableCollection protocols, as well as for the specific type you’re using.
ja: 可変コレクションにおけるインデックス無効化についてのさらなる情報は、MutableCollectionおよびRangeReplaceableCollectionプロトコルに対してのリファレンスを見てください、もちろんあなたが使っている特定の型に対しても。

source: For more information about the Unicode terms used in this discussion, see the Unicode.org glossary.
ja: この解説において使われるユニコード用語についてのさらなる情報は、Unicode.org用語集を見てください。

source: For more information about the available rounding rules, see the FloatingPointRoundingRule enumeration.
ja: 利用可能な丸め規則についてのさらなる情報として、FloatingPointRoundingRule列挙を見てください。

source: For more information about using arrays, see Array and ArraySlice, with which ContiguousArray shares most properties and methods.
ja: 配列の使用についてのさらなる情報は、ArrayとArraySliceを見てください、それらとContiguousArrayはほとんどのプロパティとメソッドを共有します。
